In [1]:
import pandas as pd

In [13]:
df= pd.read_csv('student1.csv')

In [14]:
df

    roll       name class   marks  age
0      1       ravi    TE  68.958   21
1      2       prem    TE  81.500   21
2      3      sahil    BE  74.000   20
3      4    chinmay    TE  88.200   21
4      5  shriniwas    TE  90.100   23
5      6    ajinkya    TE  69.660   21
6      7       asha    TE  63.280   20
7      8     ayesha    BE  49.550   20
8      9       amar    BE  68.958   19
9     10      amita    BE  68.958   23
10    11       amol    TE  56.750   21
11    12      anmol    BE  68.958   21

In [17]:
df.mean(numeric_only=True)

roll      6.500000
marks    70.739333
age      20.916667
dtype: float64

In [19]:
df.median(numeric_only=True)

roll      6.500
marks    68.958
age      21.000
dtype: float64

In [21]:
df.std(numeric_only=True)

roll      3.605551
marks    11.756324
age       1.164500
dtype: float64

In [23]:
print(df.min())

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [24]:
print(df.max())

roll            12
name     shriniwas
class           TE
marks         90.1
age             23
dtype: object

In [25]:
import numpy as np

In [26]:
np.std(df['marks'])

np.float64(11.255823273113148)

In [27]:
gr1 = df.groupby('class')

In [28]:
te = gr1.get_group('TE')

In [29]:
te.min()

roll           1
name     ajinkya
class         TE
marks      56.75
age           20
dtype: object

In [30]:
te.max()

roll            11
name     shriniwas
class           TE
marks         90.1
age             23
dtype: object

In [31]:
gr2 = df.groupby('age')

In [32]:
gr2.groups

{19: [8], 20: [2, 6, 7], 21: [0, 1, 3, 5, 10, 11], 23: [4, 9]}

In [33]:
tw = gr2.get_group(20)

In [34]:
tw

   roll    name class  marks  age
2     3   sahil    BE  74.00   20
6     7    asha    TE  63.28   20
7     8  ayesha    BE  49.55   20

In [53]:
import seaborn as sns
df = sns.load_dataset('iris')
print(df)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [56]:
df = px.data.iris()

In [59]:
df=pd.read_csv('iris.csv')
df.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [60]:
gr = df.groupby('species')

In [61]:
se = gr.get_group('setosa')
ve = gr.get_group('versicolor')
vi = gr.get_group('virginica')

In [62]:
se.shape

(50, 5)

In [68]:
ve.shape

(50, 5)

In [69]:
vi.shape

(50, 5)

In [70]:
se.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,50.00000,50.000000,50.000000,50.000000
mean,5.00600,3.428000,1.462000,0.246000
std,0.35249,0.379064,0.173664,0.105386
min,4.30000,2.300000,1.000000,0.100000
25%,4.80000,3.200000,1.400000,0.200000
50%,5.00000,3.400000,1.500000,0.200000
75%,5.20000,3.675000,1.575000,0.300000
max,5.80000,4.400000,1.900000,0.600000

In [71]:
ve.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,50.000000,50.000000,50.000000,50.000000
mean,5.936000,2.770000,4.260000,1.326000
std,0.516171,0.313798,0.469911,0.197753
min,4.900000,2.000000,3.000000,1.000000
25%,5.600000,2.525000,4.000000,1.200000
50%,5.900000,2.800000,4.350000,1.300000
75%,6.300000,3.000000,4.600000,1.500000
max,7.000000,3.400000,5.100000,1.800000

In [72]:
vi.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,50.00000,50.000000,50.000000,50.00000
mean,6.58800,2.974000,5.552000,2.02600
std,0.63588,0.322497,0.551895,0.27465
min,4.90000,2.200000,4.500000,1.40000
25%,6.22500,2.800000,5.100000,1.80000
50%,6.50000,3.000000,5.550000,2.00000
75%,6.90000,3.175000,5.875000,2.30000
max,7.90000,3.800000,6.900000,2.50000